<H1>PEOPLE ANALYTICS by SHELYN YAASINTA </H1>

In [1]:
# 1. import library
import pandas as pd

In [2]:
# 2. load data

df = pd.read_csv('Extended_Employee_Performance_and_Productivity_Data.csv')
df.head()

,Employee_ID,Department,Gender,Age,Job_Title,Hire_Date,Years_At_Company,Education_Level,Performance_Score,Monthly_Salary,Work_Hours_Per_Week,Projects_Handled,Overtime_Hours,Sick_Days,Remote_Work_Frequency,Team_Size,Training_Hours,Promotions,Employee_Satisfaction_Score,Resigned
0,1,IT,Male,55,Specialist,2022-01-19 08:03:05.556036,2,High School,5,6750.0,33,32,22,2,0,14,66,0,2.63,False
1,2,Finance,Male,29,Developer,2024-04-18 08:03:05.556036,0,High School,5,7500.0,34,34,13,14,100,12,61,2,1.72,False
2,3,Finance,Male,55,Specialist,2015-10-26 08:03:05.556036,8,High School,3,5850.0,37,27,6,3,50,10,1,0,3.17,False
3,4,Customer Support,Female,48,Analyst,2016-10-22 08:03:05.556036,7,Bachelor,2,4800.0,52,10,28,12,100,10,0,1,1.86,False
4,5,Engineering,Female,36,Analyst,2021-07-23 08:03:05.556036,3,Bachelor,2,4800.0,38,11,29,13,100,15,9,1,1.25,False

In [3]:
# 3. inspect data 
df.columns

Index(['Employee_ID', 'Department', 'Gender', 'Age', 'Job_Title', 'Hire_Date',
       'Years_At_Company', 'Education_Level', 'Performance_Score',
       'Monthly_Salary', 'Work_Hours_Per_Week', 'Projects_Handled',
       'Overtime_Hours', 'Sick_Days', 'Remote_Work_Frequency', 'Team_Size',
       'Training_Hours', 'Promotions', 'Employee_Satisfaction_Score',
       'Resigned'],
      dtype='object')

In [4]:
df.shape

(100000, 20)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Employee_ID                  100000 non-null  int64
 1   Department                   100000 non-null  object
 2   Gender                       100000 non-null  object
 3   Age                          100000 non-null  int64
 4   Job_Title                    100000 non-null  object
 5   Hire_Date                    100000 non-null  object
 6   Years_At_Company             100000 non-null  int64
 7   Education_Level              100000 non-null  object
 8   Performance_Score            100000 non-null  int64
 9   Monthly_Salary               100000 non-null  float64
 10  Work_Hours_Per_Week          100000 non-null  int64
 11  Projects_Handled             100000 non-null  int64
 12  Overtime_Hours               100000 non-null  int64
 13  Sick_Days                    100000 non-null  int64
 14  Remote_Work_Frequency        100000 non-null  int64
 15  Team_Size                    100000 non-null  int64
 16  Training_Hours               100000 non-null  int64
 17  Promotions                   100000 non-null  int64
 18  Employee_Satisfaction_Score  100000 non-null  float64
 19  Resigned                     100000 non-null  bool
dtypes: bool(1), float64(2), int64(12), object(5)
memory usage: 14.6+ MB

In [6]:
# Mengubah Hire_Date ke datetime
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])

# Cek hasil
print(df['Hire_Date'].dtype)
print(df['Hire_Date'].head())

datetime64[ns]
0   2022-01-19 08:03:05.556036
1   2024-04-18 08:03:05.556036
2   2015-10-26 08:03:05.556036
3   2016-10-22 08:03:05.556036
4   2021-07-23 08:03:05.556036
Name: Hire_Date, dtype: datetime64[ns]

In [7]:
# mengkategorikan tipe data yang numerik dan kategorikal
numerik = df.select_dtypes(include=['number']).columns.tolist()
kategorikal = df.select_dtypes(exclude=['number']).columns.tolist()

In [8]:
df[numerik].head()

,Employee_ID,Age,Years_At_Company,Performance_Score,Monthly_Salary,Work_Hours_Per_Week,Projects_Handled,Overtime_Hours,Sick_Days,Remote_Work_Frequency,Team_Size,Training_Hours,Promotions,Employee_Satisfaction_Score
0,1,55,2,5,6750.0,33,32,22,2,0,14,66,0,2.63
1,2,29,0,5,7500.0,34,34,13,14,100,12,61,2,1.72
2,3,55,8,3,5850.0,37,27,6,3,50,10,1,0,3.17
3,4,48,7,2,4800.0,52,10,28,12,100,10,0,1,1.86
4,5,36,3,2,4800.0,38,11,29,13,100,15,9,1,1.25

In [9]:
df[kategorikal].head()

,Department,Gender,Job_Title,Hire_Date,Education_Level,Resigned
0,IT,Male,Specialist,2022-01-19 08:03:05.556036,High School,False
1,Finance,Male,Developer,2024-04-18 08:03:05.556036,High School,False
2,Finance,Male,Specialist,2015-10-26 08:03:05.556036,High School,False
3,Customer Support,Female,Analyst,2016-10-22 08:03:05.556036,Bachelor,False
4,Engineering,Female,Analyst,2021-07-23 08:03:05.556036,Bachelor,False

In [10]:
# mendeskripsikan data numerik 
df.describe()

,Employee_ID,Age,Hire_Date,Years_At_Company,Performance_Score,Monthly_Salary,Work_Hours_Per_Week,Projects_Handled,Overtime_Hours,Sick_Days,Remote_Work_Frequency,Team_Size,Training_Hours,Promotions,Employee_Satisfaction_Score
count,100000.000000,100000.000000,100000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000
mean,50000.500000,41.029410,2019-09-15 06:20:20.916036096,4.476070,2.995430,6403.211000,44.956950,24.431170,14.514930,7.008550,50.090500,10.013560,49.506060,0.999720,2.999088
min,1.000000,22.000000,2014-09-07 08:03:05.556036,0.000000,1.000000,3850.000000,30.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000
25%,25000.750000,31.000000,2017-03-20 08:03:05.556036096,2.000000,2.000000,5250.000000,37.000000,12.000000,7.000000,3.000000,25.000000,5.000000,25.000000,0.000000,2.010000
50%,50000.500000,41.000000,2019-09-21 08:03:05.556036096,4.000000,3.000000,6500.000000,45.000000,24.000000,15.000000,7.000000,50.000000,10.000000,49.000000,1.000000,3.000000
75%,75000.250000,51.000000,2022-03-14 08:03:05.556036096,7.000000,4.000000,7500.000000,53.000000,37.000000,22.000000,11.000000,75.000000,15.000000,75.000000,2.000000,3.990000
max,100000.000000,60.000000,2024-09-03 08:03:05.556036,10.000000,5.000000,9000.000000,60.000000,49.000000,29.000000,14.000000,100.000000,19.000000,99.000000,2.000000,5.000000
std,28867.657797,11.244121,NaN,2.869336,1.414726,1372.508717,8.942003,14.469584,8.664026,4.331591,35.351157,5.495405,28.890383,0.815872,1.150719

In [11]:
# mendeskripsikan data kategori
df.describe(include = 'object')

       Department  Gender   Job_Title Education_Level
count      100000  100000      100000          100000
unique          9       3           7               4
top     Marketing    Male  Specialist        Bachelor
freq        11216   48031       14507           50041

Handling missing values ,data duplicates and outliers

In [12]:
# mendeteksi data duplikasi
df.duplicated().sum()

np.int64(0)

In [13]:
# mengecek missing value 
df.isna().sum()

Employee_ID                    0
Department                     0
Gender                         0
Age                            0
Job_Title                      0
Hire_Date                      0
Years_At_Company               0
Education_Level                0
Performance_Score              0
Monthly_Salary                 0
Work_Hours_Per_Week            0
Projects_Handled               0
Overtime_Hours                 0
Sick_Days                      0
Remote_Work_Frequency          0
Team_Size                      0
Training_Hours                 0
Promotions                     0
Employee_Satisfaction_Score    0
Resigned                       0
dtype: int64

In [14]:
# deteksi outlier dengan IQR 
# Hitung Q1,Q3 dan IQR 
Q1 = df[numerik].quantile(0.25)
Q3 = df[numerik].quantile(0.75)
IQR = Q3 - Q1

# tentukan batas bawah dan atas 
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR 

# hapus baris yang memiliki outlier di salah satu kolom numerik 
df_outlier   = df[((df[numerik] < lower_bound) | (df[numerik] > upper_bound)).any(axis=1)]

print("Data Outlier: ",df_outlier.shape[0]," baris")

Data Outlier:  0  baris

<h2>2</h2>

 Feature Engineering

In [15]:
import pandas as pd
import numpy as np
from datetime import datetime

# FEATURE ENGINEERING SIMPLE + EXPORT UNTUK POWER BI

# 1. BASIC METRICS
df['Attrition'] = df['Resigned'].astype(int)
df['Attrition_Rate'] = df['Resigned'].mean() * 100  # Untuk overall metric

# 2. WORKLOAD & BURNOUT FEATURES
df['Total_Workload_Hours'] = df['Work_Hours_Per_Week'] + df['Overtime_Hours']
df['Work_Intensity'] = df['Total_Workload_Hours'] / 40  # 40 jam normal
df['Productivity_Rate'] = df['Projects_Handled'] / df['Work_Hours_Per_Week']

# Burnout Risk Score (SIMPLE VERSION)
df['Burnout_Risk_Score'] = (
    (df['Overtime_Hours'] / 20) * 0.4 +           # Overtime contribution
    (df['Work_Hours_Per_Week'] / 60) * 0.3 +      # Weekly hours contribution  
    (df['Sick_Days'] / 10) * 0.3                  # Health impact
).clip(0, 1)

# Burnout Risk Category
df['Burnout_Risk_Category'] = pd.cut(
    df['Burnout_Risk_Score'],
    bins=[0, 0.3, 0.7, 1],
    labels=['Low Burnout Risk', 'Medium Burnout Risk', 'High Burnout Risk']
)

# 3. REMOTE WORK CATEGORIZATION
df['Remote_Work_Type'] = np.select(
    [
        df['Remote_Work_Frequency'] == 0,
        df['Remote_Work_Frequency'] == 100,
        df['Remote_Work_Frequency'] <= 50
    ],
    ['Full Office', 'Full Remote', 'Hybrid'],
    default='Hybrid'
)

# 4. SALARY FAIRNESS METRICS
df['Salary_Quartile'] = pd.qcut(df['Monthly_Salary'], q=4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
df['Salary_to_Performance_Ratio'] = df['Monthly_Salary'] / df['Performance_Score']

# 5. CAREER PROGRESSION
df['Promotion_Rate'] = df['Promotions'] / (df['Years_At_Company'] + 1)
df['Performance_Trend'] = df['Performance_Score'] / (df['Years_At_Company'] + 1)


# Export semua data ke CSV
output_filename = 'Employee_Analytics_Simple.csv'
df.to_csv(output_filename, index=False)